# Size Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSizeSet..::..Size Property
WireSizeSet Class See Also
---
Returns the number of wire sizes that are in the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Size { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Size As Integer
	Get
```

Visual C++
---
```text
public:
virtual property int Size {
	int get ();
}
```

# See Also
WireSizeSet Class
Autodesk.Revit.DB.Electrical Namespace